In [2]:
import pandas as pd
import numpy as np

In [3]:
print(pd.__version__)
lst=[1,2,3,4,5]
s=pd.Series(lst)
print(s)

2.1.4
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
#throuogh np array
s1=pd.Series(np.array(lst))
print(s1)

# pandas series have two attributes data and index as list

s2=pd.Series(data=["Anant","Manoj","GFG"], index=[1,2,3,])
print(s2)

0    1
1    2
2    3
3    4
4    5
dtype: int32
1    Anant
2    Manoj
3      GFG
dtype: object

In [5]:
print(pd.Series([4,5]).repeat(3))
print("-"*10)
s3=pd.Series([ 4,5,6]).repeat([5,2,1]).reset_index(drop=True)
print(s3)
print("-"*10)
print(s2[1])
len(s2)

0    4
0    4
0    4
1    5
1    5
1    5
dtype: int64
----------
0    4
1    4
2    4
3    4
4    4
5    5
6    5
7    6
dtype: int64
----------
Anant

3

In [6]:
print(s3[:-1])

0    4
1    4
2    4
3    4
4    4
5    5
6    5
dtype: int64

In [7]:
print(s1.agg(["min","max","sum"]))
print("-"*10)
print(s1.abs())

min     1
max     5
sum    15
dtype: int64
----------
0    1
1    2
2    3
3    4
4    5
dtype: int32

In [8]:
s4=pd.Series([-2,334,-12,23,2],[1,2,3,4,5])
print(s4.nlargest(2,keep='first'))

2    334
4     23
dtype: int64

In [9]:
print(s1)
print("-"*10)
print(s3)

0    1
1    2
2    3
3    4
4    5
dtype: int32
----------
0    4
1    4
2    4
3    4
4    4
5    5
6    5
7    6
dtype: int64

In [10]:
s5=s1._append(s3).sort_index()
s5

0    1
0    4
1    2
1    4
2    3
2    4
3    4
3    4
4    5
4    4
5    5
6    5
7    6
dtype: int64

In [11]:
# to change data type use Astype function
s6=s5.astype('float')
s6

0    1.0
0    4.0
1    2.0
1    4.0
2    3.0
2    4.0
3    4.0
3    4.0
4    5.0
4    4.0
5    5.0
6    5.0
7    6.0
dtype: float64

In [12]:
#between function
#returns true if the values are between the number
print(s5[s5.between(3,5,inclusive='neither')])

0    4
1    4
2    4
3    4
3    4
4    4
dtype: int64

In [13]:
csr=pd.Series(['ABhgfjdC','    xyz anda','GFor G',"hello work"])

print(csr.str.upper())
print("-"*20)

print(csr.str.lower(),end='\n\n')
print("-"*20)

print(csr.str.contains('l'),end='\n\n')
print("-"*20)

print(csr.str.split('o'),end='\n\n')
print("-"*20)

print(csr.str.strip())
print("-"*20)

0        ABHGFJDC
1        XYZ ANDA
2          GFOR G
3      HELLO WORK
dtype: object
--------------------
0        abhgfjdc
1        xyz anda
2          gfor g
3      hello work
dtype: object

--------------------
0    False
1    False
2    False
3     True
dtype: bool

--------------------
0        [ABhgfjdC]
1    [    xyz anda]
2         [GF, r G]
3    [hell,  w, rk]
dtype: object

--------------------
0      ABhgfjdC
1      xyz anda
2        GFor G
3    hello work
dtype: object
--------------------

In [14]:
type(csr)

pandas.core.series.Series

In [15]:
pd.Series([['lala','llo'],'kor'])

0    [lala, llo]
1            kor
dtype: object

In [16]:
print(csr[csr.str.contains('A')] ,end='\n\n')
print(csr.str.replace('A',"  "))

0    ABhgfjdC
dtype: object

0         BhgfjdC
1        xyz anda
2          GFor G
3      hello work
dtype: object

In [17]:
print(csr.str.count('a'))

0    0
1    2
2    0
3    0
dtype: int64

In [18]:
print(csr.str.find('l')+1)

0    0
1    0
2    0
3    3
dtype: int64

In [19]:
#to convert panda series into list again use .to_list()
csr.str.strip().to_list()

['ABhgfjdC', 'xyz anda', 'GFor G', 'hello work']

# Panda DataFrame

In [20]:
lst=['a','b','c','d']
lst1=[['A','a'],['B','b'],['C','c']]
print(pd.DataFrame(lst))
pd.DataFrame(lst1)

   0
0  a
1  b
2  c
3  d

   0  1
0  A  a
1  B  b
2  C  c

In [21]:
data={'Name':['a','b','c','d','e'], 'Age':[12,32,45,23,11]}
pd.DataFrame(data)

  Name  Age
0    a   12
1    b   32
2    c   45
3    d   23
4    e   11

In [133]:
data={
    'Name':['Ram','Anil','Balam','kid'],
    'Age' :[23,23,22,12],
    'City':['Allahabad','Kanpur','Mirzapur','NCR'],
    'Qualification':['B.tech','B.tech','MCA','4th Grade']
}
D1=pd.DataFrame(data)
D1[['Name','City']]

    Name       City
0    Ram  Allahabad
1   Anil     Kanpur
2  Balam   Mirzapur
3    kid        NCR

# loc() & illoc()

In [134]:
D1.loc[1:3]

    Name  Age      City Qualification
1   Anil   23    Kanpur        B.tech
2  Balam   22  Mirzapur           MCA
3    kid   12       NCR     4th Grade

In [135]:
D1.loc[2:]

    Name  Age      City Qualification
2  Balam   22  Mirzapur           MCA
3    kid   12       NCR     4th Grade

In [136]:
D1.loc[0:3 , 'Name':'City']

    Name  Age       City
0    Ram   23  Allahabad
1   Anil   23     Kanpur
2  Balam   22   Mirzapur
3    kid   12        NCR

In [137]:
D1.loc[D1['Age']>20,'Name':'City']

    Name  Age       City
0    Ram   23  Allahabad
1   Anil   23     Kanpur
2  Balam   22   Mirzapur

In [138]:
D1.iloc[1:3,2:]
#integer based / upper bound excluded

       City Qualification
1    Kanpur        B.tech
2  Mirzapur           MCA

In [139]:
D1.iloc[[1,3]]
#difference is comma is used instead of colon

   Name  Age    City Qualification
1  Anil   23  Kanpur        B.tech
3   kid   12     NCR     4th Grade

# using Conditions

In [140]:
D1[D1['Age']>20]

    Name  Age       City Qualification
0    Ram   23  Allahabad        B.tech
1   Anil   23     Kanpur        B.tech
2  Balam   22   Mirzapur           MCA

# ADDING columns

In [141]:
# BY LIST
lst=['AI','IT','CSE','AI']
D1['Branch']=lst
D1

    Name  Age       City Qualification Branch
0    Ram   23  Allahabad        B.tech     AI
1   Anil   23     Kanpur        B.tech     IT
2  Balam   22   Mirzapur           MCA    CSE
3    kid   12        NCR     4th Grade     AI

In [142]:
# BY Series
lst=[8.9,7.2,6.5,7.8]
sr=pd.Series(lst)
D1['SGPA']=sr
D1

    Name  Age       City Qualification Branch  SGPA
0    Ram   23  Allahabad        B.tech     AI   8.9
1   Anil   23     Kanpur        B.tech     IT   7.2
2  Balam   22   Mirzapur           MCA    CSE   6.5
3    kid   12        NCR     4th Grade     AI   7.8

In [143]:
# BY existing column
D1['Year of Birth']=2024-D1['Age']
D1

    Name  Age       City Qualification Branch  SGPA  Year of Birth
0    Ram   23  Allahabad        B.tech     AI   8.9           2001
1   Anil   23     Kanpur        B.tech     IT   7.2           2001
2  Balam   22   Mirzapur           MCA    CSE   6.5           2002
3    kid   12        NCR     4th Grade     AI   7.8           2012

# DELETE colums

In [159]:
D1.drop('SGPA',axis='columns')
#can use 1 for column and 0 for row

   b
0  2
1  4

In [145]:
del D1['Branch']
D1

    Name  Age       City Qualification  SGPA  Year of Birth
0    Ram   23  Allahabad        B.tech   8.9           2001
1   Anil   23     Kanpur        B.tech   7.2           2001
2  Balam   22   Mirzapur           MCA   6.5           2002
3    kid   12        NCR     4th Grade   7.8           2012

# TO POP a column

In [146]:
D1.pop('Year of Birth')
print("-"*50)
print(D1)

--------------------------------------------------
    Name  Age       City Qualification  SGPA
0    Ram   23  Allahabad        B.tech   8.9
1   Anil   23     Kanpur        B.tech   7.2
2  Balam   22   Mirzapur           MCA   6.5
3    kid   12        NCR     4th Grade   7.8

# append rows to a data frame

In [164]:
d1=pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
d2=pd.DataFrame([[5,6],[7,8]],columns=['a','b'])

data=pd.concat([d2,d1]).reset_index(drop=True)

In [165]:
data.T

   0  1  2  3
a  5  7  1  3
b  6  8  2  4

In [168]:
D1.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['Name', 'Age', 'City', 'Qualification', 'SGPA'], dtype='object')]

In [169]:
D1.ndim

2

In [171]:
D1.dtypes

Name              object
Age                int64
City              object
Qualification     object
SGPA             float64
dtype: object

In [174]:
D1.head()

    Name  Age       City Qualification  SGPA
0    Ram   23  Allahabad        B.tech   8.9
1   Anil   23     Kanpur        B.tech   7.2
2  Balam   22   Mirzapur           MCA   6.5
3    kid   12        NCR     4th Grade   7.8

In [175]:
D1.head(3)

    Name  Age       City Qualification  SGPA
0    Ram   23  Allahabad        B.tech   8.9
1   Anil   23     Kanpur        B.tech   7.2
2  Balam   22   Mirzapur           MCA   6.5

In [213]:
D1.tail()

    Name  Age       City Qualification  SGPA
0    Ram   23  Allahabad        B.tech   8.9
1   Anil   23     Kanpur        B.tech   7.2
2  Balam   22   Mirzapur           MCA   6.5
3    kid   12        NCR     4th Grade   7.8

 ## Satistical Operations

In [185]:
D1.sum(numeric_only=True)

Age     80.0
SGPA    30.4
dtype: float64

In [187]:
D1.sum()

Name                        RamAnilBalamkid
Age                                      80
City             AllahabadKanpurMirzapurNCR
Qualification      B.techB.techMCA4th Grade
SGPA                                   30.4
dtype: object

In [190]:
D1.mean(numeric_only=True)

Age     20.0
SGPA     7.6
dtype: float64

In [191]:
D1.median(numeric_only=True)

Age     22.5
SGPA     7.5
dtype: float64

In [195]:
D1.var(numeric_only=True)

Age     28.666667
SGPA     1.033333
dtype: float64

In [196]:
D1.max()

Name             kid
Age               23
City             NCR
Qualification    MCA
SGPA             8.9
dtype: object

In [197]:
D1.min()

Name                  Anil
Age                     12
City             Allahabad
Qualification    4th Grade
SGPA                   6.5
dtype: object

In [199]:
D1.std(numeric_only=True)

Age     5.354126
SGPA    1.016530
dtype: float64

# Describe Func()

In [210]:
D1.describe()

             Age     SGPA
count   4.000000  4.00000
mean   20.000000  7.60000
std     5.354126  1.01653
min    12.000000  6.50000
25%    19.500000  7.02500
50%    22.500000  7.50000
75%    23.000000  8.07500
max    23.000000  8.90000

In [209]:
D1.describe(include=[object])

       Name       City Qualification
count     4          4             4
unique    4          4             3
top     Ram  Allahabad        B.tech
freq      1          1             2

In [203]:
D1.describe(include='all')

       Name        Age       City Qualification     SGPA
count     4   4.000000          4             4  4.00000
unique    4        NaN          4             3      NaN
top     Ram        NaN  Allahabad        B.tech      NaN
freq      1        NaN          1             2      NaN
mean    NaN  20.000000        NaN           NaN  7.60000
std     NaN   5.354126        NaN           NaN  1.01653
min     NaN  12.000000        NaN           NaN  6.50000
25%     NaN  19.500000        NaN           NaN  7.02500
50%     NaN  22.500000        NaN           NaN  7.50000
75%     NaN  23.000000        NaN           NaN  8.07500
max     NaN  23.000000        NaN           NaN  8.90000

In [202]:
s = pd.DataFrame([
    np.datetime64("2000-01-01"),
    np.datetime64("2010-01-01"),
    np.datetime64("2010-01-01")
])
s.describe()

                         0
count                    3
mean   2006-09-01 08:00:00
min    2000-01-01 00:00:00
25%    2004-12-31 12:00:00
50%    2010-01-01 00:00:00
75%    2010-01-01 00:00:00
max    2010-01-01 00:00:00

In [238]:

print(D1)
print("-"*45)
ls=[1,2,3,4]
D1.reindex([1,0,3,2])

    Name  Age       City Qualification  SGPA
0    Ram   23  Allahabad        B.tech   8.9
1   Anil   23     Kanpur        B.tech   7.2
2  Balam   22   Mirzapur           MCA   6.5
3    kid   12        NCR     4th Grade   7.8
---------------------------------------------

    Name  Age       City Qualification  SGPA
1   Anil   23     Kanpur        B.tech   7.2
0    Ram   23  Allahabad        B.tech   8.9
3    kid   12        NCR     4th Grade   7.8
2  Balam   22   Mirzapur           MCA   6.5

In [245]:
D1.rename(columns={'City':'Sheher'},index={0:'a',1:'b'})

    Name  Age     Sheher Qualification  SGPA
a    Ram   23  Allahabad        B.tech   8.9
b   Anil   23     Kanpur        B.tech   7.2
2  Balam   22   Mirzapur           MCA   6.5
3    kid   12        NCR     4th Grade   7.8

In [273]:
D1.sort_values(by=['SGPA','Age'],axis=0,ascending=True,kind='stable')

    Name  Age       City Qualification  SGPA   age
2  Balam   12   Mirzapur           MCA   6.5  12.0
1   Anil   23     Kanpur        B.tech   7.2   NaN
3    kid   12        NCR     4th Grade   7.8   NaN
0    Ram   23  Allahabad        B.tech   8.9   NaN

# UPDATE values in data frame

In [277]:
D1.loc[D1['City']=='Mirzapur','Age']=12
D1

    Name  Age       City Qualification  SGPA
0    Ram   23  Allahabad        B.tech   8.9
1   Anil   23     Kanpur        B.tech   7.2
2  Balam   12   Mirzapur           MCA   6.5
3    kid   12        NCR     4th Grade   7.8

In [302]:
grp=D1.groupby('Qualification')

In [313]:
grp['SGPA'].agg(['sum',"mean",'min'])

                sum  mean  min
Qualification
4th Grade       7.8  7.80  7.8
B.tech         16.1  8.05  7.2
MCA             6.5  6.50  6.5

# READING EXTERNAL CSV FILE

In [ ]:
df=pd.read_csv("")